In [2]:
import pandas as pd
import numpy as np
import datetime
import matplotlib.pyplot as plt

In [27]:
df = pd.read_csv('../preprocessed_data/[DB]아파트_층별_소비전력_2023-03-16 06.30.00 ~ 2023-08-30 10.30.00.csv', usecols=[1,2,3,4])
df['TIMESTAMP'] = pd.to_datetime(df['TIMESTAMP'])

# df.set_index(df['TIMESTAMP'], inplace=True)
# df.drop('TIMESTAMP', inplace=True, axis = 1)

df = df.iloc[670:]
df = df.reset_index(drop = True)
df

                 TIMESTAMP  BUILDING  FLOOR  CONSUMPTION(W)
0      2023-03-20 22:10:00       561      1            1303
1      2023-03-20 22:20:00       561      1            1403
2      2023-03-20 22:30:00       561      1            1564
3      2023-03-20 22:40:00       561      1            1532
4      2023-03-20 22:50:00       561      1            1552
...                    ...       ...    ...             ...
793734 2023-08-30 09:50:00       563     12             488
793735 2023-08-30 10:00:00       563     12             672
793736 2023-08-30 10:10:00       563     12             688
793737 2023-08-30 10:20:00       563     12             625
793738 2023-08-30 10:30:00       563     12             614

[793739 rows x 4 columns]

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 793739 entries, 0 to 793738
Data columns (total 4 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   TIMESTAMP       793739 non-null  datetime64[ns]
 1   BUILDING        793739 non-null  int64
 2   FLOOR           793739 non-null  int64
 3   CONSUMPTION(W)  793739 non-null  int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 24.2 MB

In [22]:
pd.Timestamp("2023-08-30 10:30:00")

Timestamp('2023-08-30 10:30:00')

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 794409 entries, 2023-03-16 06:30:00 to 2023-08-30 10:30:00
Data columns (total 3 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   BUILDING        794409 non-null  int64
 1   FLOOR           794409 non-null  int64
 2   CONSUMPTION(W)  794409 non-null  int64
dtypes: int64(3)
memory usage: 24.2 MB

In [5]:
df = pd.read_csv('./dynamic_topology_alg_result.csv', usecols=[1,2,3,4,5,6,7])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 588160 entries, 0 to 588159
Data columns (total 7 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   TIMESTAMP            588160 non-null  object
 1   561_CONSUMPTION(kW)  588160 non-null  float64
 2   562_CONSUMPTION(kW)  588160 non-null  float64
 3   563_CONSUMPTION(kW)  588160 non-null  float64
 4   load1                588085 non-null  float64
 5   load2                587998 non-null  float64
 6   load3                587874 non-null  float64
dtypes: float64(6), object(1)
memory usage: 31.4+ MB

In [12]:
df.loc[df['load2'].isna().to_list()]

,TIMESTAMP,561_CONSUMPTION(kW),562_CONSUMPTION(kW),563_CONSUMPTION(kW),load1,load2,load3
16119,2022-07-29 4:39,47.750200,0.000000e+00,-4.780000e+29,2.0,NaN,NaN
22964,2022-08-02 22:44,-0.023656,0.000000e+00,2.720000e+16,2.0,NaN,NaN
30684,2022-08-08 7:24,32.153500,0.000000e+00,-1.280000e+38,2.0,NaN,NaN
37330,2022-08-12 22:10,98.099700,0.000000e+00,-9.220000e-05,2.0,NaN,NaN
41262,2022-08-15 15:42,-1550.270000,-2.730000e+16,-9.210000e-05,2.0,NaN,NaN
...,...,...,...,...,...,...,...
566549,2023-08-15 10:29,79.439200,0.000000e+00,0.000000e+00,2.0,NaN,NaN
566987,2023-08-15 17:47,0.000000,0.000000e+00,0.000000e+00,NaN,NaN,NaN
567044,2023-08-15 18:44,0.000000,0.000000e+00,0.000000e+00,NaN,NaN,NaN
573525,2023-08-20 6:45,0.000000,0.000000e+00,0.000000e+00,NaN,NaN,NaN
581216,2023-08-25 14:56,55.967500,0.000000e+00,0.000000e+00,2.0,NaN,NaN

In [14]:
df.iloc[22960 : 22964 +3]

,TIMESTAMP,561_CONSUMPTION(kW),562_CONSUMPTION(kW),563_CONSUMPTION(kW),load1,load2,load3
22960,2022-08-02 22:40,118.161000,98.5465,5.040360e+01,0.0,1.0,2.0
22961,2022-08-02 22:41,118.339000,99.2827,5.301490e+01,0.0,1.0,2.0
22962,2022-08-02 22:42,126.272000,101.2730,4.980940e+01,0.0,0.0,2.0
22963,2022-08-02 22:43,126.272000,101.2730,4.980940e+01,0.0,0.0,2.0
22964,2022-08-02 22:44,-0.023656,0.0000,2.720000e+16,2.0,NaN,NaN
22965,2022-08-02 22:45,117.631000,95.7405,4.823420e+01,0.0,1.0,2.0
22966,2022-08-02 22:46,112.790000,104.8270,5.016520e+01,0.0,0.0,2.0

In [15]:
df['562_CONSUMPTION(kW)'].describe()

count    5.881600e+05
mean    -2.740759e+32
std      1.733671e+35
min     -1.290000e+38
25%      4.423667e+01
50%      5.296640e+01
75%      6.613650e+01
max      4.580000e+23
Name: 562_CONSUMPTION(kW), dtype: float64

In [17]:
df = pd.read_csv('../preprocessed_data/아파트_동별_소비전력_전력분배_2022-07-18~2023-08-30.csv', usecols=range(1,8))
df

,TIMESTAMP,561_CONSUMPTION(kW),562_CONSUMPTION(kW),563_CONSUMPTION(kW),561_bus,562_bus,563_bus
0,2022-07-18 0:00,62.1733,67.7842,38.3382,1.0,2.0,0.0
1,2022-07-18 0:01,65.9248,69.0978,37.1818,1.0,2.0,0.0
2,2022-07-18 0:02,65.0934,69.3263,37.6485,1.0,2.0,0.0
3,2022-07-18 0:03,69.8256,67.6393,33.9469,2.0,1.0,0.0
4,2022-07-18 0:04,66.7572,66.2724,34.6464,2.0,1.0,0.0
...,...,...,...,...,...,...,...
588155,2023-08-30 10:35,42.7607,48.8069,29.6012,1.0,2.0,1.0
588156,2023-08-30 10:36,42.6679,49.6149,26.8150,1.0,2.0,1.0
588157,2023-08-30 10:37,45.4780,51.7969,25.4370,1.0,2.0,1.0
588158,2023-08-30 10:38,44.4553,52.2081,25.2467,1.0,2.0,1.0
588159,2023-08-30 10:39,44.4350,52.9664,25.2734,1.0,2.0,1.0

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 588160 entries, 0 to 588159
Data columns (total 7 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   TIMESTAMP            588160 non-null  object
 1   561_CONSUMPTION(kW)  588160 non-null  float64
 2   562_CONSUMPTION(kW)  588160 non-null  float64
 3   563_CONSUMPTION(kW)  588160 non-null  float64
 4   561_bus              588160 non-null  float64
 5   562_bus              588160 non-null  float64
 6   563_bus              588160 non-null  float64
dtypes: float64(6), object(1)
memory usage: 31.4+ MB

In [23]:
df['TIMESTAMP'] = pd.to_datetime(df['TIMESTAMP'])

df['561_bus'] = df['561_bus'].astype('int')
df['562_bus'] = df['562_bus'].astype('int')
df['563_bus'] = df['563_bus'].astype('int')

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 588160 entries, 0 to 588159
Data columns (total 7 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   TIMESTAMP            588160 non-null  datetime64[ns]
 1   561_CONSUMPTION(kW)  588160 non-null  float64
 2   562_CONSUMPTION(kW)  588160 non-null  float64
 3   563_CONSUMPTION(kW)  588160 non-null  float64
 4   561_bus              588160 non-null  int32
 5   562_bus              588160 non-null  int32
 6   563_bus              588160 non-null  int32
dtypes: datetime64[ns](1), float64(3), int32(3)
memory usage: 24.7 MB

In [24]:
df

,TIMESTAMP,561_CONSUMPTION(kW),562_CONSUMPTION(kW),563_CONSUMPTION(kW),561_bus,562_bus,563_bus
0,2022-07-18 00:00:00,62.1733,67.7842,38.3382,1,2,0
1,2022-07-18 00:01:00,65.9248,69.0978,37.1818,1,2,0
2,2022-07-18 00:02:00,65.0934,69.3263,37.6485,1,2,0
3,2022-07-18 00:03:00,69.8256,67.6393,33.9469,2,1,0
4,2022-07-18 00:04:00,66.7572,66.2724,34.6464,2,1,0
...,...,...,...,...,...,...,...
588155,2023-08-30 10:35:00,42.7607,48.8069,29.6012,1,2,1
588156,2023-08-30 10:36:00,42.6679,49.6149,26.8150,1,2,1
588157,2023-08-30 10:37:00,45.4780,51.7969,25.4370,1,2,1
588158,2023-08-30 10:38:00,44.4553,52.2081,25.2467,1,2,1
588159,2023-08-30 10:39:00,44.4350,52.9664,25.2734,1,2,1

In [25]:
df.to_csv('../preprocessed_data/아파트_동별_소비전력_전력분배_2022-07-18~2023-08-30.csv')

In [13]:
df.duplicated(['TIMESTAMP']).sum()

0

In [2]:
df = pd.DataFrame()

df

Empty DataFrame
Columns: []
Index: []

In [7]:
df = pd.concat([df, pd.DataFrame({'test' : [1], 'tes1' : [2]})])

df

   test  tes1
0     1     2

In [11]:
df = pd.concat([df, pd.DataFrame({'test' : [2,3,4], 'tes1' : [5,5,5]})], ignore_index=True)

df

   test  tes1
0     1     2
1     2     5
2     3     5
3     4     5
4     2     5
5     3     5
6     4     5
7     2     5
8     3     5
9     4     5

In [13]:
pd.DataFrame({'test':[], 'test2':[]})

Empty DataFrame
Columns: [test, test2]
Index: []